IRP/src/AccumulationRegisters/PartnerApTransactions/PartnerApTransactions.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>PartnerApTransactions</name>
  <resources>
    <name>Amount</name>
    <type>
      <types>DefinedType.typeAmount</types>
    </type>
  </resources>
  <attributes>
    <name>DeferredCalculation</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </dimensions>
  <dimensions>
    <name>BasisDocument</name>
    <type>
      <types>DefinedType.typeApTransactionBasises</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Partner</name>
    <type>
      <types>CatalogRef.Partners</types>
    </type>
  </dimensions>
  <dimensions>
    <name>LegalName</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Agreement</name>
    <type>
      <types>CatalogRef.Agreements</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Currency</name>
    <type>
      <types>CatalogRef.Currencies</types>
    </type>
  </dimensions>
  <dimensions>
    <name>CurrencyMovementType</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.CurrencyMovementType</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

IRP/src/AccumulationRegisters/PartnerArTransactions/PartnerArTransactions.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>PartnerArTransactions</name>
  <resources>
    <name>Amount</name>
    <type>
      <types>DefinedType.typeAmount</types>
    </type>
  </resources>
  <attributes>
    <name>DeferredCalculation</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </dimensions>
  <dimensions>
    <name>BasisDocument</name>
    <type>
      <types>DefinedType.typeArTransactionBasises</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Partner</name>
    <type>
      <types>CatalogRef.Partners</types>
    </type>
  </dimensions>
  <dimensions>
    <name>LegalName</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Agreement</name>
    <type>
      <types>CatalogRef.Agreements</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Currency</name>
    <type>
      <types>CatalogRef.Currencies</types>
    </type>
  </dimensions>
  <dimensions>
    <name>CurrencyMovementType</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.CurrencyMovementType</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

IRP/src/Enums/ChequeBondTypes/ChequeBondTypes.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
 <name>ChequeBondTypes</name>
 <enumValues>
  <name>OwnCheque</name>
 </enumValues>
 <enumValues>
  <name>PartnerCheque</name>
 </enumValues>
 <enumValues>
  <name>OwnObligation</name>
 </enumValues>
 <enumValues>
  <name>PartnerObligation</name>
 </enumValues>
</mdclass:Enum>

IRP/src/Documents/CashTransferOrder/CashTransferOrder.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>CashTransferOrder</name>
  <registerRecords>AccumulationRegister.R3035T_CashPlanning</registerRecords>
  <registerRecords>InformationRegister.PostedDocumentsRegistry</registerRecords>
  <attributes>
    <name>CashAdvanceHolder</name>
    <type>
      <types>CatalogRef.Partners</types>
    </type>
  </attributes>
  <attributes>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </attributes>
  <attributes>
    <name>ReceiveAmount</name>
    <type>
      <types>DefinedType.typeAmount</types>
    </type>
  </attributes>
  <attributes>
    <name>ReceiveCurrency</name>
    <type>
      <types>CatalogRef.Currencies</types>
    </type>
  </attributes>
  <attributes>
    <name>ReceivePeriod</name>
    <type>
      <types>CatalogRef.PlanningPeriods</types>
    </type>
  </attributes>
  <attributes>
    <name>Receiver</name>
    <type>
      <types>CatalogRef.CashAccounts</types>
    </type>
  </attributes>
  <attributes>
    <name>ReceiveUUID</name>
    <type>
      <types>DefinedType.typeRowID</types>
    </type>
  </attributes>
  <attributes>
    <name>SendAmount</name>
    <type>
      <types>DefinedType.typeAmount</types>
    </type>
  </attributes>
  <attributes>
    <name>SendCurrency</name>
    <type>
      <types>CatalogRef.Currencies</types>
    </type>
  </attributes>
  <attributes>
    <name>SendPeriod</name>
    <type>
      <types>CatalogRef.PlanningPeriods</types>
    </type>
  </attributes>
  <attributes>
    <name>Sender</name>
    <type>
      <types>CatalogRef.CashAccounts</types>
    </type>
  </attributes>
  <attributes>
    <name>SendUUID</name>
    <type>
      <types>DefinedType.typeRowID</types>
    </type>
  </attributes>
  <attributes>
    <name>SendFinancialMovementType</name>
    <type>
      <types>CatalogRef.ExpenseAndRevenueTypes</types>
    </type>
  </attributes>
  <attributes>
    <name>ReceiveFinancialMovementType</name>
    <type>
      <types>CatalogRef.ExpenseAndRevenueTypes</types>
    </type>
  </attributes>
  <attributes>
    <name>ReceiveBranch</name>
    <type>
      <types>CatalogRef.BusinessUnits</types>
    </type>
  </attributes>
  <attributes>
    <name>SendLocalTotalAmount</name>
    <type>
      <types>DefinedType.typeAmount</types>
    </type>
  </attributes>
  <attributes>
    <name>SendLocalRate</name>
    <type>
      <types>DefinedType.typeCurrencyRate</types>
    </type>
  </attributes>
  <attributes>
    <name>ReceiveLocalTotalAmount</name>
    <type>
      <types>DefinedType.typeAmount</types>
    </type>
  </attributes>
  <attributes>
    <name>ReceiveLocalRate</name>
    <type>
      <types>DefinedType.typeCurrencyRate</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Currencies</name>
    <attributes>
      <name>Key</name>
      <type>
        <types>DefinedType.typeRowID</types>
      </type>
    </attributes>
    <attributes>
      <name>CurrencyFrom</name>
      <type>
        <types>CatalogRef.Currencies</types>
      </type>
    </attributes>
    <attributes>
      <name>Rate</name>
      <type>
        <types>DefinedType.typeCurrencyRate</types>
      </type>
    </attributes>
    <attributes>
      <name>ReverseRate</name>
      <type>
        <types>DefinedType.typeCurrencyRate</types>
      </type>
    </attributes>
    <attributes>
      <name>ShowReverseRate</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Multiplicity</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>MovementType</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.CurrencyMovementType</types>
      </type>
    </attributes>
    <attributes>
      <name>Amount</name>
      <type>
        <types>DefinedType.typeAmount</types>
      </type>
    </attributes>
    <attributes>
      <name>IsFixed</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>AddAttributes</name>
    <attributes>
      <name>Property</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.AddAttributeAndProperty</types>
      </type>
    </attributes>
    <attributes>
      <name>Value</name>
      <type>
        <types>Characteristic.AddAttributeAndProperty</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

IRP/src/ChartsOfCharacteristicTypes/CurrencyMovementType/CurrencyMovementType.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfCharacteristicTypes>
 <name>CurrencyMovementType</name>
 <type>
  <types>EnumRef.CurrencyType</types>
 </type>
 <predefined>
  <items>
   <name>SettlementCurrency</name>
   <type>
    <types>EnumRef.CurrencyType</types>
   </type>
  </items>
  <items>
   <name>Default_PartnerTerm</name>
   <type>
    <types>EnumRef.CurrencyType</types>
   </type>
  </items>
  <items>
   <name>Default_Legal</name>
   <type>
    <types>EnumRef.CurrencyType</types>
   </type>
  </items>
 </predefined>
 <attributes>
  <name>Currency</name>
  <type>
   <types>CatalogRef.Currencies</types>
  </type>
 </attributes>
 <attributes>
  <name>Source</name>
  <type>
   <types>CatalogRef.IntegrationSettings</types>
  </type>
 </attributes>
 <attributes>
  <name>Type</name>
  <type>
   <types>EnumRef.CurrencyType</types>
  </type>
 </attributes>
 <attributes>
  <name>DeferredCalculation</name>
  <type>
   <types>Boolean</types>
  </type>
 </attributes>
 <attributes>
  <name>NotPostIfRateNotSet</name>
  <type>
   <types>Boolean</types>
  </type>
 </attributes>
 <attributes>
  <name>EverydayRates</name>
  <type>
   <types>Boolean</types>
  </type>
 </attributes>
</mdclass:ChartOfCharacteristicTypes>

IRP/src/CommonForms/PickUpDocuments/Module.bsl
#Region FormEvents

&AtServer
Procedure OnCreateAtServer(Cancel, StandardProcessing)
	Currency = Parameters.FiltersStructure.Currencies;
	ChequeAmount = Parameters.FiltersStructure.ChequeAmount;
	If Parameters.Property("FiltersStructure") Then
		SetDocumentListQueryText(Parameters);
		SetVisibility(ThisObject, Parameters.FiltersStructure);
	EndIf;
	
	UpdateHeader(ThisObject);
EndProcedure

&AtServer
Procedure SetDocumentListQueryText(Parameters)
	Filters = Parameters.FiltersStructure;
	If Filters.QueryType = "ChequeBondTransaction" Then
		ChequeBondType = Filters.Cheque.Type;
		If ChequeBondType = PredefinedValue("Enum.ChequeBondTypes.OwnCheque") Then
			ThisObject.Title = R().Title_00100;
			SetQueryTextChequeBondTransactionOwnCheque(Parameters);
		ElsIf ChequeBondType = PredefinedValue("Enum.ChequeBondTypes.PartnerCheque") Then
			ThisObject.Title = R().Title_00100;
			SetQueryTextChequeBondTransactionPartnerCheque(Parameters);
		Else
			Return;
		EndIf;
	EndIf;
EndProcedure

&AtServer
Procedure SetQueryTextChequeBondTransactionOwnCheque(Parameters)
	Filters = Parameters.FiltersStructure;
	
	DocumentsList.CustomQuery = True;
	DocumentsList.QueryText = "SELECT
	|	PartnerApTransactionsBalance.BasisDocument,
	|	PartnerApTransactionsBalance.AmountBalance,
	|	PartnerApTransactionsBalance.Company,
	|	PartnerApTransactionsBalance.Currency,
	|	PartnerApTransactionsBalance.LegalName,
	|	PartnerApTransactionsBalance.Agreement,
	|	Isnull(PartnerApTransactionsBalance.BasisDocument.DocumentAmount, 0) As DocumentAmount,
	|	PartnerApTransactionsBalance.Partner
	|FROM
	|	AccumulationRegister.PartnerApTransactions.Balance(&EndDate, VALUETYPE(BasisDocument) IN
	|	(TYPE(Document.PurchaseInvoice), TYPE(Document.SalesReturn), TYPE(Document.CashTransferOrder))
	|	AND CurrencyMovementType = VALUE(ChartOfCharacteristicTypes.CurrencyMovementType.SettlementCurrency)) AS
	|		PartnerApTransactionsBalance";
	
	DocumentsList.Parameters.SetParameterValue("EndDate", Filters.EndDate);
	DocumentsList.Filter.Items.Clear();
	
	Filter = DocumentsList.Filter.Items.Add(Type("DataCompositionFilterItem"));
	Filter.Use = ValueIsFilled(Filters.Partners);
	Filter.LeftValue = New DataCompositionField("Partner");
	Filter.ComparisonType = DataCompositionComparisonType.InList;
	Filter.RightValue = Filters.Partners;
	
	Filter = DocumentsList.Filter.Items.Add(Type("DataCompositionFilterItem"));
	Filter.Use = ValueIsFilled(Filters.Companies);
	Filter.LeftValue = New DataCompositionField("Company");
	Filter.ComparisonType = DataCompositionComparisonType.InList;
	Filter.RightValue = Filters.Companies;
	
	Filter = DocumentsList.Filter.Items.Add(Type("DataCompositionFilterItem"));
	Filter.Use = ValueIsFilled(Filters.LegalNames);
	Filter.LeftValue = New DataCompositionField("LegalName");
	Filter.ComparisonType = DataCompositionComparisonType.InList;
	Filter.RightValue = Filters.LegalNames;
	
	Filter = DocumentsList.Filter.Items.Add(Type("DataCompositionFilterItem"));
	Filter.Use = ValueIsFilled(Filters.Agreements);
	Filter.LeftValue = New DataCompositionField("Agreement");
	Filter.ComparisonType = DataCompositionComparisonType.InList;
	Filter.RightValue = Filters.Agreements;
	
	Filter = DocumentsList.Filter.Items.Add(Type("DataCompositionFilterItem"));
	Filter.Use = ValueIsFilled(Filters.Currencies);
	Filter.LeftValue = New DataCompositionField("Currency");
	Filter.ComparisonType = DataCompositionComparisonType.InList;
	Filter.RightValue = Filters.Currencies;
	
	For Each Row In Parameters.RowsArray Do
		NewRow = PickedDocuments.Add();
		FillPropertyValues(NewRow, Row);
		NewRow.Key = Filters.Key;
		NewRow.Currency = Currency;
		NewRow.AmountBalance = Row.Amount;
	EndDo;
EndProcedure

&AtServer
Procedure SetQueryTextChequeBondTransactionPartnerCheque(Parameters)
	Filters = Parameters.FiltersStructure;
	
	DocumentsList.CustomQuery = True;
	DocumentsList.QueryText = "SELECT
	|	PartnerArTransactionsBalance.BasisDocument,
	|	PartnerArTransactionsBalance.AmountBalance,
	|	PartnerArTransactionsBalance.Company,
	|	PartnerArTransactionsBalance.Currency,
	|	PartnerArTransactionsBalance.LegalName,
	|	PartnerArTransactionsBalance.Agreement,
	|	Isnull(PartnerArTransactionsBalance.BasisDocument.DocumentAmount, 0) As DocumentAmount,
	|	PartnerArTransactionsBalance.Partner
	|FROM
	|	AccumulationRegister.PartnerArTransactions.Balance(&EndDate, VALUETYPE(BasisDocument) IN
	|	(TYPE(Document.SalesInvoice), TYPE(Document.PurchaseReturn), TYPE(Document.CashTransferOrder))
	|	AND CurrencyMovementType = VALUE(ChartOfCharacteristicTypes.CurrencyMovementType.SettlementCurrency)) AS
	|		PartnerArTransactionsBalance";
	
	DocumentsList.Parameters.SetParameterValue("EndDate", Filters.EndDate);
	DocumentsList.Filter.Items.Clear();
	
	Filter = DocumentsList.Filter.Items.Add(Type("DataCompositionFilterItem"));
	Filter.Use = ValueIsFilled(Filters.Partners);
	Filter.LeftValue = New DataCompositionField("Partner");
	Filter.ComparisonType = DataCompositionComparisonType.InList;
	Filter.RightValue = Filters.Partners;
	
	Filter = DocumentsList.Filter.Items.Add(Type("DataCompositionFilterItem"));
	Filter.Use = ValueIsFilled(Filters.Companies);
	Filter.LeftValue = New DataCompositionField("Company");
	Filter.ComparisonType = DataCompositionComparisonType.InList;
	Filter.RightValue = Filters.Companies;
	
	Filter = DocumentsList.Filter.Items.Add(Type("DataCompositionFilterItem"));
	Filter.Use = ValueIsFilled(Filters.LegalNames);
	Filter.LeftValue = New DataCompositionField("LegalName");
	Filter.ComparisonType = DataCompositionComparisonType.InList;
	Filter.RightValue = Filters.LegalNames;
	
	Filter = DocumentsList.Filter.Items.Add(Type("DataCompositionFilterItem"));
	Filter.Use = ValueIsFilled(Filters.Agreements);
	Filter.LeftValue = New DataCompositionField("Agreement");
	Filter.ComparisonType = DataCompositionComparisonType.InList;
	Filter.RightValue = Filters.Agreements;
	
	Filter = DocumentsList.Filter.Items.Add(Type("DataCompositionFilterItem"));
	Filter.Use = ValueIsFilled(Filters.Currencies);
	Filter.LeftValue = New DataCompositionField("Currency");
	Filter.ComparisonType = DataCompositionComparisonType.InList;
	Filter.RightValue = Filters.Currencies;
	
	For Each Row In Parameters.RowsArray Do
		NewRow = PickedDocuments.Add();
		FillPropertyValues(NewRow, Row);
		NewRow.Key = Filters.Key;
		NewRow.Currency = Currency;
		NewRow.AmountBalance = Row.Amount;
	EndDo;
EndProcedure

&AtServerNoContext
Procedure SetVisibility(Form, FiltersStructure)
	Form.Items.PickedDocumentsPartnerApBasisDocument.Visible = 
			Form.ChequeBondType = PredefinedValue("Enum.ChequeBondTypes.OwnCheque");
	Form.Items.PickedDocumentsPartnerArBasisDocument.Visible = 
			Form.ChequeBondType = PredefinedValue("Enum.ChequeBondTypes.PartnerCheque");
	Form.Items.TotalAmount.Visible = False;
EndProcedure
#EndRegion

#Region FormtensEvents
&AtClient
Procedure DocumentsListSelection(Item, RowSelected, Field, StandardProcessing)
	StandardProcessing = False;
	
	CurrentData = Items.DocumentsList.CurrentData;
	If CurrentData = Undefined Then
		Return;
	EndIf;
	
	NewRow = PickedDocuments.Add();
	FillPropertyValues(NewRow, CurrentData);
	If ChequeBondType = PredefinedValue("Enum.ChequeBondTypes.OwnCheque") Then
		NewRow.PartnerApBasisDocument = CurrentData.BasisDocument;
		NewRow.AmountBalance = 0;
		RowFilter = New Structure("PartnerApBasisDocument", CurrentData.BasisDocument);
	ElsIf ChequeBondType = PredefinedValue("Enum.ChequeBondTypes.PartnerCheque") Then
		NewRow.PartnerArBasisDocument = CurrentData.BasisDocument;
		NewRow.AmountBalance = 0;
		RowFilter = New Structure("PartnerApBasisDocument", CurrentData.BasisDocument);
	Else
		RowFilter = New Structure("Key", Undefined);
		NewRow.PartnerArBasisDocument = Undefined;
	EndIf;
	
	AmountBalance = CurrentData.AmountBalance; 
	Rows = PickedDocuments.FindRows(RowFilter);
	For Each Row In Rows Do
		AmountBalance = AmountBalance - Row.AmountBalance; 
	EndDo;

	NewRow.AmountBalance = AmountBalance;
	NewRow.Key = ThisObject.Key;
	
	UpdateHeader(ThisObject);
EndProcedure

#EndRegion

#Region Commands
&AtClient
Procedure CommandSaveAndClose(Command)
	Close(ThisObject.PickedDocuments);
EndProcedure

&AtClient
Procedure PickedDocumentsAfterDeleteRow(Item)
	UpdateHeader(ThisObject);
EndProcedure

&AtClient
Procedure PickedDocumentsAmountBalanceOnChange(Item)
	UpdateHeader(ThisObject);
EndProcedure

&AtClientAtServerNoContext
Procedure UpdateHeader(Form)
	Form.DistributedAmount = Form.PickedDocuments.Total("AmountBalance");
	Form.RemainingAmount = Form.ChequeAmount - Form.DistributedAmount;
	Form.TotalAmount = Form.PickedDocuments.Total("AmountBalance");
EndProcedure

&AtClient
Procedure Edit(Command)
	CurrentData = Items.DocumentsList.CurrentData;
	If CurrentData = Undefined Then
		Return;
	EndIf;
	
	ShowValue(, CurrentData.BasisDocument);
EndProcedure

&AtClient
Procedure PickedDocumentsSelection(Item, RowSelected, Field, StandardProcessing)
	DocChequeBondTransactionClient.ShowApArDocument(ThisObject, Item, RowSelected, Field, StandardProcessing);
EndProcedure

#EndRegion
